Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: So here, these are arteries going away from the heart to the lungs, to the alveoli because they want the blood that's traveling in them to get oxygen.
ht: Men isit la, se sa artères ta pwale kite konprann pou yo sa yo poumon yo, pou alveoli yo paske yo vle san sa vwayaje nan yo pou yo jwenn oksijèn.

source: So what's going to happen is that the air is flowing through the bronchioles and circulating around the alveoli, filling the alveoli-- and as they fill the alveoli, the little molecules of oxygen are allowed to cross the membrane of the alveoli and essentially be absorbed into the blood.
ht: Se poutèt sa ki pwal pase se sa lè a ap swiv à bronchioles Et qui autour a alveoli, alveoli - remplissage menm jan yo ranpli alveoli yo, ti molécules de oksijèn yo gen dwa pou travèse a len de alveoli Et être esansyèlman pèdi nan san an.

source: I'll do a lot more on that when we talk about hemoglobin and red blood cells, but you just have to realize that there's just a lot of capillaries.
ht: M a fè anpil plis sou lè sa nou pale osijè moglobin globil wouj nan san yo, men nou jis gen pou reyalize sa pa gen sèlman yon bann kapilè.

source: Capillaries are just super small blood vessels that allow air to pass-- essentially oxygen and carbon dioxide molecules to pass between them.
ht: Kapilè sont jis super ti san bato ki pèmèt Lè nan peyi san chapo - esansyèlman oksijèn Et kabòn dyosid molécules pou yo pase ant yo.

source: These have a lot of capillaries on them that allow the exchange of gases.
ht: Sa gen yon bann kapilè yo ki pèmèt echanj gaz.

source: So the oxygen can go into this blood and so once the oxygen-- so this is the vessel that's coming from the heart and then it's just a tube.
ht: Se konsa oksijèn a ka antre nan san sa a ak sa yon fwa oksijèn an- Se poutèt sa veso sa a ap vini nan mitan Et puis li se jis yon tib.

source: So then once it gets the oxygen, it's going to go back to the heart.
ht: Se konsa lè sa a yon fwa, li vin oksijèn an, li pwal pou-m tounen pou kè moun.

source: And so essentially this is the point where this vessel, this pipe, part of our circulatory system, goes from being an artery-- because it's coming from the heart-- to a vein because it's going back to the heart.
ht: Se konsa esansyèlman se pwen kote sa a zanj lan vide gode sa a fè tiyo, pati nan sistèm du nou an, va de cours yon gwo venn - paske l' ap vini nan mitan - pou yon venn nan janm paske li ap tounen pou kè moun.

source: And there's a special word for these arteries and veins.
ht: Et se yon lòd espesyal pou yo te sa artères Et varis.

source: They're called pulmonary arteries and veins.
ht: Yo ap rele pulmonaire artères Et varis.

source: So going away from the heart to the lungs, to the alveoli, these are the pulmonary arteries.
ht: Se konsa pwal kite kè poumon yo, pou alveoli yo, se sa artères pulmonaire yo a.

source: And going back to the heart are the pulmonary veins.
ht: Et ap tounen lakay pou kè sont pulmonaire venn. Koulye a ou di, Sal, sa ki vle di ti kay?

source: Well, pulmo comes from the Latin for the lungs.
ht: Men, pulmo soti Latin nan pou poumon.

source: It literally means the arteries that are of the lungs or that go to the lungs and the veins that come from the lungs.
ht: Mo pou mo setadi artères ki nan poumon ou ki ale nan poumon epi venn sa soti nan poumon.

source: So anytime people talk about pulmonary anything, they're talking about our lungs-- or maybe something related to how we breathe.
ht: Se konsa tout moun pale osijè pulmonaire nenpòt bagay, bagay yo ap ap pale de fwa mou nou - ou gen dwa bagay ki gen rapò kijan nou ap respire.

source: So it's a good word to know.
ht: Se konsa, li se yon bon pawòl pou konnen.

source: So anyway, you have your oxygen coming in through your mouth or your nose, through the pharynx-- it could fill your stomach.
ht: Se konsa ou gen oksijèn ou ap vini à ou soti nan bouch ou bwa nen ou, nan èyè gòj - li te kapab kenbe vant ou.

source: We can blow up our stomach like a balloon, but that doesn't help us actually get oxygen to our blood stream.
ht: Nou kapab eklate vant nou tankou yon blad, men, sa pa ede nou jwenn aktyèlman oksijèn pou ravin san nou.

source: But the oxygen will come through our larynx, into our trachea, through the bronchi, eventually in bronchioles, ending up in alveoli and being able to be absorbed into what where the arteries, but then we're going to go back and then essentially oxygenate the blood.
ht: Men, oksijèn a ap pase sou nou nou òd vokal/vwa nan nou kannal souf/lè, à wonch, evantyèlman nan bronchioles, se nan alveoli Et kapab kenbe être absorbé nan sa ki kote artères yo, men lè sa a nou pral tounen Et Lè sa a esansyèlman oxygenate san.

source: The red blood cells become red once the hemoglobin becomes very red or scarlet once it actually has the oxygen and then we go back.
ht: Selil wouj yo vin wouj une moglobin a est trè wouj ou wouj yon fwa ke li genyen aktyèlman oksijèn an Et Lè sa a, nou tounen.

source: But at the same time, this isn't just about getting oxygen into our arteries or onto the hemoglobin.
ht: Men an menm tan an, sa se pat jis Sur comment oksijèn nan artères nou ou sou moglobin a.

source: It's also about releasing carbon dioxide.
ht: Tou Sur libération kabòn li.

source: So these blue arteries coming from the lungs are also going to release carbon dioxide into the alveoli.
ht: Se konsa artères ble sa yo soti nan poumon tou pwal pou yo bay kabòn nan alveoli yo.

source: And these will be exhaled.
ht: Et sa a exhaled.

source: So we have oxygen coming in.
ht: Se poutèt sa, nou dwe oksijèn vini nan.

source: Other things will be coming in, but the O2 is what gets absorbed in the alveoli.
ht: Lòt bagay pwal vini, men, O2 a se sa obtient pèdi nan alveoli yo.

source: And then when we breathe out, we're going to have carbon dioxide that was in our blood, but then it gets absorbed into the alveoli and they get squeezed out.
ht: Et puis lè nou respire, nou pral gen kabòn dyosid sa yo ki te nan san nou, men, apre sa li jwenn pèdi nan alveoli Et yo jwenn pressé deyò.

source: I'm going to tell you in a second how it gets squeezed.
ht: M ap di w nan yon lòt jan li gen pressé. Li se aktyèlman sa Sur ke aktyèlman - lè a

source: It's actually that squeezing out that actually-- when the air goes back out, it can vibrate my vocal cords and it'll allow me to talk, but I'm not going to go into too much detail about that.
ht: Lè va tounen, li kapab il m' vokal/vwa Et sa pwal pèmèt mwen pale, men, mwen pa pwal ale nan tou plis detay sou sa.

source: So the last thing to consider about this whole pulmonary system or about our lungs is, how does it force the air in and how does it force the air out?
ht: Se konsa dènyè bagay pou konsidere sa tout pulmonaire sistèm ou sou nou poumon se, ki fè l' fòs de lè nan Et, ki fè l' fòs de lè soti?

source: And the way it's done is really kind of like a-- you could imagine it's kind of a pump or a balloon-- is that we have this huge layer of flat muscles.
ht: Wout la li ap fè a, se konsa menm kalite tankou yon - ou te kapab imajine se yon ti jan ponp ou yon blad - se sa nou gen sa a yon gwo kouch voye misk plat.

source: Let me pick a good color here.
ht: Kite m' chwazi yon bon koulè isit la. Droit anba poumon - Et sa se te rele thoracique kapòt pou fanm.

source: And so when it's relaxed, it kind of has this arch shape, and so the lungs are kind of squeezed in.
ht: Se konsa, lè l' ilaks, li ti jan gen fòm arch sa a, epi se konsa poumon sont ti jan de pressé.

source: They don't have a lot of volume.
ht: Yo pa gen anpil volim.

source: But when I essentially breathe in, what's happening is this thoracic diaphragm is contracted and when it's contracted, it gets shorter, but more importantly, it opens up the space where my lungs are.
ht: Men, lè mwen esansyèlman respire, sa k ap pase sa wotèj fanm thoracique trape osinon lè li pa trape, li vin pi kout, men pi enpòtan toujou, li te ouvè pran plas kote m' poumon yo.

source: So my lungs can fill up that space.
ht: Se konsa m' poumon ka ranpli kanpe nan plas sa.

source: So what it does is, it essentially-- it's like pulling a balloon larger, making the volume of my lungs larger.
ht: Se poutèt sa, se sa l' fè, li esansyèlman - se tankou trennen yo pote ale yon blad pi gwo, fè a volim poumon m' pi gwo.

source: And when you make the volume of something larger-- so the lungs will become larger as my thoracic diaphragm is contracted and it kind of arches down, creates more space-- and as the volume of something becomes larger, the pressure inside of them goes down.
ht: Lè n' ap volim yon bagay pi gwo - Et pour la poumon ap tounen pi gwo jan m' thoracique kapòt pou fanm trape Et sa Nature de mete atè, kreye plis galeri - Et volim yon bagay tankou devient plus, la bay/fè presyon andedan yo va.

source: If you remember from physics, the pressure times volume is a constant.
ht: Si ou pa bliye de fizik, la bay/fè presyon tan volim se yon pèmanan.

source: So when we breathe in, our brain is essentially telling our diaphragm to contract.
ht: Se konsa lè nou respire sèvo nou esansyèlman di dyafram nou pou kontra. Nou gen plis sou dèyè nan poumon nou.

source: Our lungs expand to fill the space.
ht: Poumon nou etann pou ranpli plas la.

source: We have less pressure here than we have outside-- or you can view it as negative pressure.
ht: Nou gen mwens pwesyon isit la pase nou gen deyò - ou ou ka wè l' tankou negatif pwesyon.

source: So air always wants to go from high pressure to low pressure and so air is going to flow into our lungs.
ht: Se konsa, lè toujou vle ale soti anwo nan syèl la bay/fè presyon pou faible bay/fè presyon e se konsa lè pwal flux nan poumon nou.

source: And hopefully there'll be some oxygen there that can then essentially go into our alveoli and end up in our arteries and then go back in the veins as oxygen attached to hemoglobin.
ht: Et, ap gen kèk oksijèn la ki kapab lè sa a esansyèlman antre nan alveoli nou ak abouti nan nou artères pou li al Apre sa tounen nan venn kòm oksijèn atache pou moglobin.

source: I'll talk more about that in detail.
ht: Mwen pwal pale plis toujou sou sa an detay.

source: And then when we stop contracting the diaphragm, it goes back to this arched position.
ht: Et puis lè nou kanpe contractantes kapòt pou fanm, sa kò nou pral tounen repozwa pozisyon sa a.

source: It contracts.
ht: Li contrats.

source: It's kind of like a rubber band.
ht: Sa se kalite tankou yon bann en.

source: It contracts back the lungs and it essentially expels the air back and now that air's going to have a lot more carbon dioxide.
ht: Contrats tounen poumon Et l' esansyèlman expels a tounen aeryen e kounye a, lè sa a pwal gen anpil plis kabòn.

source: And just to get a sense of-- I can look at my lungs-- I can't look at them, but they don't seem too large.
ht: Et jis pou jwenn yon sans de - mwen ka gade m' fwa mou-mwen pa kapab gade yo, men, se pa pawòl twò laj.

source: How do I get enough oxygen in them-- and the key is, is that because of this branching process and the alveoli, the inside surface area of the lungs are actually much larger than you can imagine-- or actually than I could have imagined had someone not told me.
ht: Kouman m ap ka jwenn oksijèn ase nan yo ­ Et kle a se sa pwosè sa, branchement, alveoli, la anndan sifas zòn nan poumon sont aktyèlman beaucoup plus ke ou ka konprann - ou aktyèlman pase mwen te kapab gen te raple m mwen te yon moun pa di m.

source: So it actually turns out-- I looked it up-- the internal surface area of your alveoli-- so the total surface area where the oxygen can be absorbed in or the carbon dioxide can be absorbed out from the blood-- it's actually 75 square meters.
ht: Se konsa, li aktyèlman active deyò-gade l' leve-a entèn surface nan zòn de alveoli - se konsa total de sifas zòn ki kote oksijèn an ka ap pèdi nan ou a kabòn dyosid ka ap pèdi soti nan san ki aktyèlman se 75 mèt kare kare.

source: That's meters, not feet.
ht: Sa se mèt, se pa pye.

source: If you think about it, that's like a-- imagine some type of a tarp or a field.
ht: Si ou panse osijè de sa, se tankou yon - imajine de yon tarp oswa yon jaden.

source: That's almost nine by nine meters.
ht: Sa se pwèske nèf pou mèt nèf.

source: That's almost 27 by 27 square feet.
ht: Sa se pwèske 27 pa 27 kare pye.

source: That's the size of some people's backyards.
ht: Sa se la taille de backyards kèk moun.

source: That's how much surface air you have inside of your lungs.
ht: Sa se konbyen de sifas lè ou gen andedan poumon ou.

source: It's all folded up.
ht: Sa tout pliye.

source: That's how it gets jammed into what look like relatively small lungs.
ht: Sa se jan li gen avanse pou antre nan sa sanble relativement fwa mou ti.

source: But that's what gives us enough surface area for enough of the air, enough of the oxygen, to cross the alveoli membrane into our blood system and enough of the carbon dioxide to go back in.
ht: Men sa se sa ban nou ase zòn nan lèspas pou kont ki nan syèl la oksijèn an, pou travèse alveoli yo len nan sistèm san nou Et la a kabòn dyosid pou-m tounen.

source: And just to have a sense of how many alveoli we had-- I told you that they're very small-- we actually have 300 million in each lung.
ht: Et sèlman pou genyen yon sans de alveoli ki kantite, nou te gen - m te di ou sa yo ke ti très ­ nou gen aktyèlman 300 milyon an chak fwa/fresi mou.

source: In each lung, we have 300 million alveoli.
ht: Nan chak fwa/fresi mou, nou genyen 300 milyon dola alveoli.

source: So anyway, hopefully that gives you a decent sense of how we at least get oxygen into our blood system and carbon dioxide out of it.
ht: Se konsa tout, sa ban nou yon sans debyen de ki jan nou pi piti obtenir oksijèn nan sistèm san nou Et kabòn soti nan li.

source: In the next video, I'll talk more about our actual circulatory system and how we get the oxygen from the lungs to the rest of the body and how do we get the carbon dioxide from the rest of the body into the lungs?
ht: Nan videyo kap vini an, m' ap pale plis toujou sou nou réel san/sikilatwa Et jan nou pran oksijèn an nan poumon pou tout rès kò a epi ki pa ka kabòn a dyosid de tout rès kò a nan poumon?

source: Write the prime factorization of 75.
ht: Ekri nan décomposition nan faktè premye a 75 an.

source: Write your answer using exponential notation.
ht: Ekri repons ou yo sèvi nan notation exponentielle.

source: So we have a couple of interesting things here.
ht: Se konsa, nou gen yon sèten kantite bagay enteresan.

source: Prime factorization, and they say exponential notation.
ht: Factorisation nonb premye ak di nan notation exponentielle.

source: We'll worry about the exponential notation later.
ht: Nou pral nou soucier nan notation exponentielle apre.

source: So the first thing we have to worry about is what is even a prime number?
ht: Lè sa a, anvan, nou te pou nou, nou soucier sa ki yon kantite premye?

source: And just as a refresher, a prime number is a number that's only divisible by itself and one, so examples of prime numbers-- let me write some numbers down.
ht: Lè yon rapèl, yon kantite premye a se yon kantite ki se divisible ke li menm ak sa yo egzanp chif premye - kite m 'ekri kèk nimewo.

source: Prime, not prime. Not prime.
ht: Premyèman, PA kouzine.

source: So 2 is a prime number.
ht: Se So 2 se yon kantite premye.

source: It's only divisible by 1 and 2.
ht: Li se sèlman divisible nan 1 ak 2.

source: 3 is another prime number.
ht: 3 se yon lòt kantite premye.

source: Now, 4 is not prime, because this is divisible by 1, 2 and 4.
ht: Koulye a, 4 PA premye yo, paske li se divisible nan 1, 2 ak 4.

source: We could keep going.
ht: Nou ta ka kontinye.

source: 5, well, 5 is only divisible by 1 and 5, so 5 is prime.
ht: 5, ak 5 se divisible ke 1 ak 5, konsa 5 se premye.

source: 6 is not prime, because it's divisible by 2 and 3.
ht: 6 PA premye paske li se divisible nan 2 ak 3.

source: I think you get the general idea.
ht: Mwen panse ke lide jeneral.

source: You move to 7, 7 is prime.
ht: Nou tout nou deplase nan 7, 7 se premye.

source: It's only divisible by 1 and 7.
ht: Li se sèlman divisible nan 1 ak 7.

source: 8 is not prime.
ht: 8 PA premye.

source: 9 you might be tempted to say is prime, but remember, it's also divisible by 3, so 9 is not prime.
ht: 9 ka sonde yo di li se premye, men sonje nou, li se divisible nan 3, konsa 9 SE PA premye.

source: Prime is not the same thing as odd numbers.
ht: Premyèman SE PA menm bagay ke nonb impairs.

source: Then if you move to 10, 10 is also not prime, divisible by 2 and 5.
ht: Kidonk, si ou deplase 10, 10 SE PA nesesè, divisible nan 2 ak 5.

source: 11, it's only divisible by 1 and 11, so 11 is then a prime number.
ht: 11 se divisible ke 1 ak 11, ki di 11 se Apre sa, yon kantite premye.

source: And we could keep going on like this.
ht: Epi nou ta ka kontinye.

source: People have written computer programs looking for the highest prime and all of that.
ht: Gen lòt moun ki te ekri nan pwogram òdinatè nan rechèch pou pi enpòtan, ak tout sa.

source: So now that we know what a prime is, a prime factorization is breaking up a number, like 75, into a product of prime numbers.
ht: Lè sa a, koulye a, nou konnen sa ki nan yon kantite premye, yon gwo factorisation rompt yon kantite tankou 75, nan yon pwodwi chif premye yo.

source: So let's try to do that.
ht: Lè sa a, eseye fè bagay sa yo.

source: So we're going to start with 75, and I'm going to do it using what we call a factorization tree.
ht: Kòmanse konsa ak 75, e mwen pral fè ak sa ke nou rele yon factorisation twa.

source: So we first try to find just the smallest prime number that will go into 75.
ht: Se konsa, anvan eseye jwenn pi piti kantite premye ki ale nan 75 lane.

source: Now, the smallest prime number is 2.
ht: Koulye a, pi piti a kantite premye se 2.

source: Does 2 go into 75?
ht: Hare 2 Go nan 75?

source: Well, 75 is an odd number, or the number in the ones place, this 5, is an odd number.
ht: Se konsa, 75 se yon kantite impair oswa nimewo a nan plas moun, 5 an, se yon kantite impair.

source: 5 is not divisible by 2, so 2 will not go into 75.
ht: 5 PA divisible nan 2, konsa de p'ap kapab antre nan 75 lane.

source: So then we could try 3.
ht: Lè sa a, ou ka eseye 3.

source: Does 3 go into 75?
ht: T 3 ale nan 75 lane?

source: Well, 7 plus 5 is 12.
ht: Enben, 7 ak 5 se 12.

source: 12 is divisible by 3, so 3 will go into it.
ht: 12 se divisible nan 3, konsa 3 pase nan li.

source: So 75 is 3 times something else.
ht: Se konsa, 75 se 3 fwa pi plis.

source: And if you've ever dealt with change, you know that if you have three quarters, you have 75 cents, or if you have 3 times 25, you have 75.
ht: Si ou deja eseye chanje, ou konnen ke si te gen twa chanm yo, moun ki a 75 santim, oswa si ou gen 3 25 fwa, li te 75 an.

source: So this is 3 times 25.
ht: Kidonk, se 3 fwa 25.

source: And you can multiply this out if you don't believe me.
ht: Epi ou ka vin anpil la, si nou p'ap vle kwè mwen.

source: Multiple out 3 times 25.
ht: Miltip 3 fwa 25.

source: Now, is 25 divisible by-- you can give up on 2.
ht: Koulye a, li divisible nan 25 - ou ka bay jiska 2.

source: If 75 wasn't divisible by 2, 25's not going to be divisible by 2 either.
ht: Si 75 SE PA divisible nan 2, 25 se p'ap divisible nan 2 tou.

source: But maybe 25 is divisible by 3 again.
ht: Men, ka 25 se divisible nan 3 fwa.

source: So if you take the digits 2 plus 5, you get 7.
ht: Kidonk, si nou pran chif 2 + 5, ou jwenn 7.

source: 7 is not divisible by 3, so 25 will not be divisible by 3.
ht: 7 SE PA divisible nan 3, konsa 25 SE PA divisible nan 3.

source: So we keep moving up:
ht: Kidonk, swiv:

source: Is 25 divisible by 5?
ht: Is 25, divisible nan 5?

source: Well, sure.
ht: Enben, se sekirite.

source: It's 5 times 5.
ht: Li se 5 fwa 5.

source: So 25 is 5 times 5.
ht: Se konsa, 25 se 5 fwa 5.

source: And we're done with our prime factorization because now we have all prime numbers here.
ht: Nou te fini ak nou yo premye affacturage, paske koulye a te tout chif premye isit la.

source: So we can write that 75 is 3 times 5 times 5.
ht: Kidonk, nou ka ekri ke 75 se 3 fwa 5 fwa 5.

source: So 75 is equal to 3 times 5 times 5.
ht: Se konsa, 75 se egal 3 fwa 5 fwa 5.

source: We can say it's 3 times 25.
ht: Nou kapab di ke se 3 fwa 25.

source: 25 is 5 times 5.
ht: 25 se 5 fwa 5.

source: 3 times 25, 25 is 5 times 5.
ht: 3 fwa 25, 25 se 5 fwa 5.

source: So this is a prime factorization, but they want us to write our answer using exponential notation.
ht: Se konsa, yon factorisation nonb premye a, men mwen vle ekri repons yo sèvi nan notation exponentielle.

source: So that just means, if we have repeated primes, we can write those as an exponent.
ht: Sa vle di konsa ke jis ke si nou te repete chif yo premye, nou ka ekri moun ki, menm jan li rapòte.

source: So what is 5 times 5?
ht: Lè sa a, ki se 5 nan 5?

source: 5 times 5 is 5 multiplied by itself two times.
ht: 5 fwa 5 se 5 sitèlman li menm menm de fwa.

source: This is the same thing as 5 to the second power.
ht: Se menm bagay la ke 5 nan dezyèm pouvwa.

source: So if we want to write our answer using exponential notation, we could say this is equal to 3 times 5 to the second power, which is the same thing as 5 times 5.
ht: Kidonk, si nou M'ap ekri nou repons avèk exponentielle notation, ta ka di ke se 3 fwa 5 nan dezyèm pouvwa a, ki se menm 5 fwa 5.

source: In the last video, we got an overview of electrotonic potentials and action potentials and how they essentially can transmit potential differences through a cell or how they can move a potential difference through a cell.
ht: Nan dènye videyo a, nou pran yon kourikoulòm de electrotonic potentiel Et aksyon potentiels ak ki jan yo ka transmèt esansyèlman gwo diferans nan yon selil ou kijan yo ka jwe yon gwo diferans nan yon selil.

source: And just as a bit of review, electrotonic is if you have some type of charge disruption-- let's say a sodium gate opens and a bunch of positive ions flow in, that very quickly is going to make things nearby more positive, right?
ht: Menm jan yon ti revi, electrotonic se si ou gen kèk gwoup de frais interruption - an n pale yon odyòm baryè s' ak yon pakèt moun flux ions pozitif nan, sa byen vit pwal fè bagay à plis pozitif, pa vre?

source: It's very quickly because the positive charges are going to move away from their positive brethren.
ht: Se byen vit paske pozitif chaj yo pwal souke kò ou kite yo frères pozitif.

source: Positives and positives repel each other.
ht: Fè positifs Et positifs ale ak lòt.

source: And so if we go some point further off in the cell-- let's say we were looking at that point right here-- the positive charges-- if there's a positive charge here, it's going to want to move in that direction.
ht: Et si nou ale kèk pwen sou tèt lòt nan selil- an n pale nou wè nan ki pwen droit isit lan-- a pozitif chaj ­ si ta gen yon pozitif frais isit la, li gen pwal pou nou vle pou avanse nan direksyon sa.

source: If you have a positive charge here, it's going to move in this direction.
ht: Si ou gen yon chaj pozitif isit la, li pwal pou yo avanse wout sa a.

source: So it's going to become more positive very quickly.
ht: Se konsa li ap vin pi pozitif byen vit.

source: So that's what we talk about electrotonic potential.
ht: Se poutèt sa se sa nou pale de electrotonic potentiels.

source: And the benefit is, it happens very, very quickly.
ht: E benefis a, sa k rive koukouloukou trè, trè byen vit.
